Mark-Walen/bsec-bme680-esp32s3/main/bsec_integration/bsec_integration.c
    return status;
}

/*!
 * @brief       Initialize the bme68x sensor and the BSEC library
 *
 * @param[in]   sample_rate         mode to be used (either BSEC_SAMPLE_RATE_ULP or BSEC_SAMPLE_RATE_LP)
 * @param[in]   temperature_offset  device-specific temperature offset (due to self-heating)
 * @param[in]   bus_write           pointer to the bus writing function
 * @param[in]   bus_read            pointer to the bus reading function
 * @param[in]   sleep               pointer to the system specific sleep function
 * @param[in]   state_load          pointer to the system-specific state load function
 * @param[in]   config_load         pointer to the system-specific config load function
 * @param[in]   dev         		pointer to the sensor communication and inventory details strucuture	
 *
 * @return      zero if successful, negative otherwise
 */
return_values_init bsec_iot_init(bsec_virtual_sensor_t sensor_list[], uint8_t n_sensors, float sample_rate, float temperature_offset, state_load_fct state_load, config_load_fct config_load,  struct bme68x_dev dev)
{
    return_values_init ret = {BME68X_OK, BSEC_OK};
    int32_t bsec_state_len, bsec_config_len;

    bme68x_g = dev;
	
    /* Initialize bme68x API */
    ret.bme68x_status = bme68x_init(&bme68x_g);
    if (ret.bme68x_status != BME68X_OK)
    {
    	printf("bme68x_init() failed\r\n");
        return ret;
    }
	else
	{
		printf("bme68x_init() successful, chip ID=0x%02x\r\n", bme68x_g.dev->info->chip_id);
	}
    
    /* Initialize BSEC library */
    ret.bsec_status = bsec_init();
    if (ret.bsec_status != BSEC_OK)
    {
        return ret;
    }
    
    // /* Load library config, if available */
    bsec_config_len = config_load(bsec_config, sizeof(bsec_config));
    if (bsec_config_len != 0)
    {       
        ret.bsec_status = bsec_set_configuration(bsec_config, bsec_config_len, work_buffer, sizeof(work_buffer));
        if (ret.bsec_status != BSEC_OK)
        {
            return ret;
        }
    }
    // printf("%s:%d\n", __FUNCTION__, __LINE__);
    /* Load previous library state, if available */
    bsec_state_len = state_load(bsec_state, sizeof(bsec_state));
    if (bsec_state_len != 0)
    {       
        ret.bsec_status = bsec_set_state(bsec_state, bsec_state_len, work_buffer, sizeof(work_buffer));     
        if (ret.bsec_status != BSEC_OK)
        {
            return ret;
        }
    }
    // printf("%s:%d\n", __FUNCTION__, __LINE__);
    /* Call to the function which sets the library with subscription information */
    ret.bsec_status = bme68x_bsec_update_subscription(sensor_list, n_sensors, sample_rate);
    if (ret.bsec_status != BSEC_OK)
    {
        return ret;
    }
    
    return ret;
}

/*!
 * @brief       This function is written to process the sensor data for the requested virtual sensors
 *
 * @param[in]   bsec_inputs         input structure containing the information on sensors to be passed to do_steps
 * @param[in]   num_bsec_inputs     number of inputs to be passed to do_steps
 * @param[in]   output_ready        pointer to the function processing obtained BSEC outputs
 *
 * @return      library function return codes, zero when successful 
 */
static bsec_library_return_t bme68x_bsec_process_data(bsec_input_t *bsec_inputs, uint8_t num_bsec_inputs, output_ready_fct_t output_ready)
{
    /* Output buffer set to the maximum virtual sensor outputs supported */
    uint8_t num_bsec_outputs = 0;
    uint8_t index = 0;

    bsec_library_return_t bsec_status = BSEC_OK;
    int64_t timestamp = 0;
    float iaq = 0.0f;
    uint8_t iaq_accuracy = 0;
    float static_iaq = 0.0f;
    float co2_equivalent = 0.0f;
    float breath_voc_equivalent = 0.0f;
	float raw_pressure = 0.0f;
	float raw_temp = 0.0f;
    float temp = 0.0f;
	float raw_humidity = 0.0f;
    float humidity = 0.0f;
	float raw_gas = 0.0f;
    float gas_percentage = 0.0f;
	float stabilization_status = 0.0f;
    float run_in_status = 0.0f;
    
    /* Check if something should be processed by BSEC */
    if (num_bsec_inputs > 0)
    {
        /* Set number of outputs to the size of the allocated buffer */
        /* BSEC_NUMBER_OUTPUTS to be defined */
        num_bsec_outputs = BSEC_NUMBER_OUTPUTS;
        
        /* Perform processing of the data by BSEC 
           Note:
           * The number of outputs you get depends on what you asked for during bsec_update_subscription(). This is
             handled under bme68x_bsec_update_subscription() function in this example file.
           * The number of actual outputs that are returned is written to num_bsec_outputs. */
        bsec_status = bsec_do_steps(bsec_inputs, num_bsec_inputs, bsec_outputs, &num_bsec_outputs);
        
        /* Iterate through the outputs and extract the relevant ones. */
        for (index = 0; index < num_bsec_outputs; index++)
        {
            switch (bsec_outputs[index].sensor_id)
            {
                case BSEC_OUTPUT_IAQ:
                    iaq = bsec_outputs[index].signal;
                    iaq_accuracy = bsec_outputs[index].accuracy;
                    break;
                case BSEC_OUTPUT_STATIC_IAQ:
                    static_iaq = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_CO2_EQUIVALENT:
                    co2_equivalent = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_BREATH_VOC_EQUIVALENT:
                    breath_voc_equivalent = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_RAW_PRESSURE:
                    raw_pressure = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_RAW_TEMPERATURE:
                    raw_temp = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_RAW_HUMIDITY:
                    raw_humidity = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_RAW_GAS:
                    raw_gas = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_STABILIZATION_STATUS:
                    stabilization_status = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_RUN_IN_STATUS:
                    run_in_status = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_TEMPERATURE:
                    temp = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_HUMIDITY:
                    humidity = bsec_outputs[index].signal;
                    break;
                case BSEC_OUTPUT_GAS_PERCENTAGE:
                    gas_percentage = bsec_outputs[index].signal;
                    break;
                default:
                    continue;
            }
            
            /* Assume that all the returned timestamps are the same */
            timestamp = bsec_outputs[index].time_stamp;
        }
        
        /* Pass the extracted outputs to the user provided output_ready() function. */
        output_ready(timestamp, iaq, iaq_accuracy, static_iaq, co2_equivalent, breath_voc_equivalent,
                     raw_pressure, raw_temp, temp, raw_humidity, humidity, raw_gas, gas_percentage,
                     stabilization_status, run_in_status, bsec_status);
    }
	return bsec_status;
}

/*!
 * @brief       Read the data from registers and populate the inputs structure to be passed to do_steps function
 *
 * @param[in]   currTimeNs      		system timestamp value passed for processing data
 * @param[in]   data                  	input structure that contains the gas sensor data to be passed to process data
 * @param[in]   bsec_process_data       process data variable returned from sensor_control
 * @param[in]   output_ready        	pointer to the function processing obtained BSEC outputs
 *
 * @return      function result, one when successful & zero when unsuccessful
 */
uint8_t processData(int64_t currTimeNs, struct bme68x_data data, int32_t bsec_process_data, output_ready_fct_t output_ready)
{
    bsec_input_t inputs[BSEC_MAX_PHYSICAL_SENSOR]; /* Temp, Pres, Hum & Gas */
	bsec_library_return_t bsec_status = BSEC_OK;
    uint8_t nInputs = 0;
    /* Checks all the required sensor inputs, required for the BSEC library for the requested outputs */
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_HEATSOURCE))
    {
        inputs[nInputs].sensor_id = BSEC_INPUT_HEATSOURCE;
        inputs[nInputs].signal = extTempOffset;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_TEMPERATURE))
    {
#ifdef BME68X_USE_FPU
        inputs[nInputs].sensor_id = BSEC_INPUT_TEMPERATURE;
#else
        inputs[nInputs].sensor_id = BSEC_INPUT_TEMPERATURE / 100.0f;
#endif
        inputs[nInputs].signal = data.temperature;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_HUMIDITY))
    {
#ifdef BME68X_USE_FPU
        inputs[nInputs].sensor_id = BSEC_INPUT_HUMIDITY;
#else
        inputs[nInputs].sensor_id = BSEC_INPUT_HUMIDITY / 1000.0f;
#endif
        inputs[nInputs].signal = data.humidity;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_PRESSURE))
    {
        inputs[nInputs].sensor_id = BSEC_INPUT_PRESSURE;
        inputs[nInputs].signal = data.pressure;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_GASRESISTOR) &&
            (data.status & BME68X_GASM_VALID_MSK))
    {
        inputs[nInputs].sensor_id = BSEC_INPUT_GASRESISTOR;
        inputs[nInputs].signal = data.gas_resistance;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }
    if (BSEC_CHECK_INPUT(bsec_process_data, BSEC_INPUT_PROFILE_PART) &&
            (data.status & BME68X_GASM_VALID_MSK))
    {
        inputs[nInputs].sensor_id = BSEC_INPUT_PROFILE_PART;
        inputs[nInputs].signal = (opMode == BME68X_FORCED_MODE) ? 0 : data.gas_index;
        inputs[nInputs].time_stamp = currTimeNs;
        nInputs++;
    }

    if (nInputs > 0)
    {
        /* Processing of the input signals and returning of output samples is performed by bsec_do_steps() */
		bsec_status = bme68x_bsec_process_data(inputs, nInputs, output_ready);

        if (bsec_status != BSEC_OK)
            return 0;
    }
    return 1;
}

/*!
 * @brief       Function to get the measurement duration in microseconds
 *
 * @param[in]   mode      			sensor operation mode to calculate the shared heater duration
 *
 * @return      calculated duration
 */
uint32_t getMeasDur(uint8_t mode)
{
	if (mode == BME68X_SLEEP_MODE)
		mode = lastOpMode;

	return bme68x_get_meas_dur(mode, &conf, &bme68x_g);
}

/**
 * @brief Set the BME68X sensor configuration to parallel mode
 *
 * @param[in]   sensor_settings     settings of the bme68x sensor adopted by sensor control function
 *
 * @return      none
 */
void setBme68xConfigParallel(bsec_bme_settings_t *sensor_settings)
{
    uint16_t sharedHeaterDur = 0;
	int8_t status;
    
	/* Set the filter, odr, temperature, pressure and humidity settings */
	status = bme68x_get_conf(&conf, &bme68x_g);
	if (status != BME68X_OK)
		return;

	conf.os_hum = sensor_settings->humidity_oversampling;
	conf.os_temp = sensor_settings->temperature_oversampling;
	conf.os_pres = sensor_settings->pressure_oversampling;
	status = bme68x_set_conf(&conf, &bme68x_g);
    if (status != BME68X_OK)
		return;
        

    sharedHeaterDur = BSEC_TOTAL_HEAT_DUR - (getMeasDur(BME68X_PARALLEL_MODE) / INT64_C(1000));
	heatr_conf.enable = BME68X_ENABLE;
	heatr_conf.heatr_temp_prof = sensor_settings->heater_temperature_profile;
	heatr_conf.heatr_dur_prof = sensor_settings->heater_duration_profile;
	heatr_conf.shared_heatr_dur = sharedHeaterDur;
	heatr_conf.profile_len = sensor_settings->heater_profile_len;
    status = bme68x_set_heatr_conf(BME68X_PARALLEL_MODE, &heatr_conf, &bme68x_g);
    if (status != BME68X_OK)
		return;

    status = bme68x_set_op_mode(BME68X_PARALLEL_MODE, &bme68x_g);
	if (status != BME68X_OK)
		return;
		
	lastOpMode = BME68X_PARALLEL_MODE;
    opMode = BME68X_PARALLEL_MODE;
}

/**
 * @brief Set the BME68X sensor configuration to forced mode
 *
 * @param[in]   sensor_settings     settings of the bme68x sensor adopted by sensor control function
 *
 * @return      none
 */
void setBme68xConfigForced(bsec_bme_settings_t *sensor_settings)
{
	int8_t status;
	
    /* Set the filter, odr, temperature, pressure and humidity settings */
	status = bme68x_get_conf(&conf, &bme68x_g);
    if (status != BME68X_OK)
		return;
	
	conf.os_hum = sensor_settings->humidity_oversampling;
	conf.os_temp = sensor_settings->temperature_oversampling;
	conf.os_pres = sensor_settings->pressure_oversampling;
	status = bme68x_set_conf(&conf, &bme68x_g);
    if (status != BME68X_OK)
		return;

