Mark-Walen/bsec-bme680-esp32s3/main/bsec_integration/bsec_integration.c
    heatr_conf.enable = BME68X_ENABLE;
	heatr_conf.heatr_temp = sensor_settings->heater_temperature;
	heatr_conf.heatr_dur = sensor_settings->heater_duration;
	status = bme68x_set_heatr_conf(BME68X_FORCED_MODE, &heatr_conf, &bme68x_g);
    if (status != BME68X_OK)
		return;

    status = bme68x_set_op_mode(BME68X_FORCED_MODE, &bme68x_g);
	if (status != BME68X_OK)
		return;
	
	lastOpMode = BME68X_FORCED_MODE;
    opMode = BME68X_FORCED_MODE;
}

/**
 * @brief Function to get a single data field
 */
/*!
 * @brief       Function to get a single data field
 *
 * @param[in]   currTimeNs      		system timestamp value passed for processing data
 * @param[in]   data                  	input structure that contains the gas sensor raw data collected
 *
 * @return      number of fields to process, zero when nothing to process
 */ 
uint8_t getData(struct bme68x_data *data)
{
	if (lastOpMode == BME68X_FORCED_MODE)
	{
		*data = sensor_data[0];
	} else
	{
		if (nFields)
		{
			/* iFields spans from 0-2 while nFields spans from
			 * 0-3, where 0 means that there is no new data
			 */
			*data = sensor_data[iFields];
			iFields++;

			/* Limit reading continuously to the last fields read */
			if (iFields >= nFields)
			{
				iFields = nFields - 1;
				return 0;
			}

			/* Indicate if there is something left to read */
			return nFields - iFields;
		}
	}

	return 0;
}

/*!
 * @brief       Runs the main (endless) loop that queries sensor settings, applies them, and processes the measured data
 *
 * @param[in]   sleep               pointer to the system specific sleep function
 * @param[in]   get_timestamp_us    pointer to the system specific timestamp derivation function
 * @param[in]   output_ready        pointer to the function processing obtained BSEC outputs
 * @param[in]   state_save          pointer to the system-specific state save function
 * @param[in]   save_intvl          interval at which BSEC state should be saved (in samples)
 *
 * @return      none
 */
void bsec_iot_loop(sleep_fct sleep_n, get_timestamp_us_fct get_timestamp_us, output_ready_fct_t output_ready,
    state_save_fct state_save, uint32_t save_intvl)
{
    /* Timestamp variables */
    int64_t time_stamp = 0;
	uint32_t tick_before, tick_after;
    
    /* BSEC sensor settings struct */
    bsec_bme_settings_t sensor_settings;
	memset(&sensor_settings, 0, sizeof(sensor_settings));
	
	/* BSEC sensor data */
	struct bme68x_data data;
    
	uint8_t nFieldsLeft = 0;
    uint32_t bsec_state_len = 0;
    uint32_t n_samples = 0;
	int8_t ret_val;
	
    opMode = sensor_settings.op_mode;
	
    bsec_library_return_t bsec_status = BSEC_OK;
	sensor_settings.next_call = 0;
	
    while (1)
    {
    	tick_before = get_timestamp();
        /* get the timestamp in nanoseconds before calling bsec_sensor_control() */
        time_stamp = get_timestamp_us() * 1000;
		if (time_stamp >= sensor_settings.next_call)
		{
			/* Retrieve sensor settings to be used in this time instant by calling bsec_sensor_control */
			bsec_status = bsec_sensor_control(time_stamp, &sensor_settings);
			if (bsec_status != BSEC_OK)
			{
				if (bsec_status < BSEC_OK)
				{
					printf("ERROR: bsec_sensor_control: %d\n", bsec_status);
					break;
				}
				else
				{
					printf("WARNING: bsec_sensor_control: %d\n", bsec_status);
				}
			}
			switch (sensor_settings.op_mode)
			{
			case BME68X_FORCED_MODE:
				setBme68xConfigForced(&sensor_settings);
				break;
			case BME68X_PARALLEL_MODE:
				if (opMode != sensor_settings.op_mode)
				{
					setBme68xConfigParallel(&sensor_settings);
				}
				break;
			case BME68X_SLEEP_MODE:
				if (opMode != sensor_settings.op_mode)
				{
					ret_val = bme68x_set_op_mode(BME68X_SLEEP_MODE, &bme68x_g);
					if ((ret_val == BME68X_OK) && (opMode != BME68X_SLEEP_MODE))
					{
						opMode = BME68X_SLEEP_MODE;
					}
				}
				break;
			}
			
			if (sensor_settings.trigger_measurement && sensor_settings.op_mode != BME68X_SLEEP_MODE)
			{
				nFields = 0;
				bme68x_get_data(lastOpMode, &sensor_data[0], &nFields, &bme68x_g);
				iFields = 0;
				if(nFields)
				{
					do
					{
						nFieldsLeft = getData(&data);
						/* check for valid gas data */
						if (data.status & BME68X_GASM_VALID_MSK)
						{
							if (!processData(time_stamp, data, sensor_settings.process_data, output_ready))
							{
								return;
							}
						}
					}while(nFieldsLeft);
				}
			}
			
			/* Increment sample counter */
			n_samples++;
			
			/* Retrieve and store state if the passed save_intvl */
			if (n_samples >= save_intvl)
			{
				bsec_status = bsec_get_state(0, bsec_state, sizeof(bsec_state), work_buffer, sizeof(work_buffer), &bsec_state_len);
				if (bsec_status == BSEC_OK)
				{
					state_save(bsec_state, bsec_state_len);
				}
				n_samples = 0;
			}
		}
		tick_after = get_timestamp();
		printf("cost %u ms\r\n", (tick_after - tick_before)/1000);
	}
}

/*! @}*/

